{
  "name": "Ciro",
  "headerTaglineOne": "Hello 👋",
  "headerTaglineTwo": "I'm Ciro Perfetto - curious",
  "headerTaglineThree": "Full Stack Devloper",
  "headerTaglineFour": " based in Naples, Italy.",
  "showCursor": true,
  "showBlog": true,
  "darkMode": true,
  "showResume": true,
  "socials": [
    {
      "id": "1",
      "title": "Github",
      "link": "https://github.com/ciroperf"
    },
    {
      "id": "2",
      "title": "LinkedIn",
      "link": "https://www.linkedin.com/in/ciro-perfetto-b07b7a198/"
    },
    { "id": "3", "title": "Email", "link": "mailto:ciroperfetto@hotmail.it" }
  ],
  "projects": [
    {
      "id": "1",
      "title": "Fake News Detection",
      "description": "Agent-based modeling and deep reinforcement learning to counter fake news spread on social media.",
      "imageSrc": "/images/netlogo.png",
      "url": "blog/fake-news-detection"
    },
    {
      "id": "2",
      "title": "All to All MPI Optimization",
      "description": "Implemented and analyzed multiple All-to-All communication algorithms using OpenMPI, based on optimization strategies presented in scientific literature. The project focused on performance evaluation and parallel communication efficiency.",
      "imageSrc": "/images/all-to-all-collective.png",
      "url": "https://github.com/MajidSalimi/HPC-2022/tree/main/AlltoAll"
    },
    {
      "id": "3",
      "title": "GitProtocol P2P",
      "description": "In this project, a basic implementation of the Git protocol was created using a P2P (peer-to-peer) network. Each peer in the network can manage its own projects (a set of files) using a simplified version of the Git protocol. The system allows users to create a new repository in a specific folder, add new files to be tracked, apply changes to the local repository (commit function), push changes to the network, and pull changes from the network. The Git protocol follows a specific behavior to handle conflicts, which are then resolved manually.",
      "imageSrc": "/images/git-protocol.png",
      "url": "https://github.com/ciroperf/GitProtocol"
    },
    {
      "id": "4",
      "title": "MPI Parallel Game Of Life",
      "description": "Project completed as part of the \"Concurrent and Parallel Programming on the Cloud\" course.It presents a solution to the Game of Life problem by leveraging parallelism through the OpenMPI library. The program was executed on an AWS cluster, and performance metrics were analyzed.The project received the highest possible grade in the course.",
      "imageSrc": "/images/Gospers_glider_gun.gif",
      "url": "https://github.com/ciroperf/mpi-parallel-game-of-life"
    },
    {
      "id": "5",
      "title": "Luxury Automotive",
      "description": "Project developed in collaboration with Accenture. The software is a mobile application for both iOS and Android, designed to support luxury car sales representatives in their customer care activities. The app was built using the Flutter framework for cross-platform development.",
      "imageSrc": "/images/luxury-automotive.jpeg",
      "url": "https://github.com/ciroperf/luxury_automotive"
    }
  ],
  "services": [],
  "aboutpara": "I'm a full-stack software developer with a strong passion for building scalable, high-quality web applications.\n\nI currently work as a consultant at Cluster Reply in Rome, where I develop solutions using C#, Node.js, Angular, and React, and manage cloud infrastructure with Microsoft Azure, Docker, and Kubernetes.\n\nI hold a Master’s degree in Computer Science, with a focus on Cloud Computing, from the University of Salerno, where I graduated with full marks and honors.\n\nMy thesis explored how to counter the spread of fake news on social media using a hybrid approach of agent-based modeling and deep reinforcement learning — combining theory, AI, and practical problem-solving.\n\nOutside of work, I love experimenting with new technologies, building bots, playing guitar and bass, staying active at the gym, and assembling custom PCs. I'm Microsoft certified (PL-900, AZ-900, AZ-204) and continuously learning to stay ahead in a fast-evolving tech landscape.",
  "resume": {
    "tagline": "💻 Passionate Full-Stack Developer | Cloud Enthusiast | Problem Solver",
    "description": "I specialize in building scalable, high-quality web applications using modern frameworks and cloud infrastructure. I'm driven by curiosity, continuous learning, and a strong desire to solve real-world problems through code.",
    "experiences": [
      {
        "id": "1",
        "dates": "October 2023 – Present",
        "type": "Full Time",
        "position": "Software Developer at Cluster Reply Rome",
        "bullets": [
          "Developed and maintained scalable enterprise web applications using C#, Angular, and React.",
          "Managed Azure infrastructure using services like AKS, App Services, and Docker.",
          "Collaborated in Agile teams, contributing to architecture discussions and cross-functional planning.",
          "Implemented REST APIs and database integrations with MySQL and MSSQL."
        ]
      }
    ],
    "education": {
      "universityName": "University of Salerno",
      "universityDate": "2020 – 2023",
      "universityPara": "Master’s Degree in Computer Science – Cloud Computing. Graduated with full marks and honors. Thesis focused on combining agent-based modeling and deep reinforcement learning to simulate and mitigate fake news diffusion on social networks."
    },
    "languages": [
      "C",
      "C#",
      "JavaScript",
      "TypeScript",
      "HTML5",
      "CSS3",
      "Python",
      "Netlogo",
      "SQL"
    ],
    "frameworks": ["React", "Angular", "Node.js", "Flutter", ".NET", "Express"],
    "others": [
      "Azure (AKS, Functions, App Services)",
      "Docker",
      "Git",
      "CI/CD",
      "Scrum/Agile",
      "Microsoft Certifications: PL-900, AZ-900, AZ-204"
    ],
    "softSkills": [
      "Problem-solving",
      "Team collaboration",
      "Communication",
      "Adaptability",
      "Time management",
      "Critical thinking",
      "Curiosity and continuous learning"
    ],
    "spokenLanguages": [
      {
        "language": "Italian",
        "proficiency": "Native"
      },
      {
        "language": "English",
        "proficiency": "C1 – Advanced (IELTS Academic 7.0)"
      }
    ]
  }
}
